homework/app/controllers/theaters_controller.rb

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1
---
  def show
    @theater = Theater.find_by_id(params[:id])

INSERT INTO "theaters" ("address", "name", "phone_number") VALUES (?, ?, ?)  [["address", "6011 S. Ingleside Ave."], ["name", "Test"], ["phone_number", "7735691643"]]
---
  def create
    t = Theater.new
    t.name = params[:name]
    t.address = params[:address]
    t.phone_number = params[:phone_number]
    t.save

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 2 LIMIT 1
---
  def edit
    @theater = Theater.find_by_id(params[:id])

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 2 LIMIT 1
UPDATE "theaters" SET "phone_number" = '773-321-1234' WHERE "theaters"."id" = 2
---
  def update
    @theater = Theater.find_by_id(params[:id])
    @theater.name = params[:name]
    @theater.address = params[:address]
    @theater.phone_number = params[:phone_number]
    @theater.save

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 2 LIMIT 1
DELETE FROM "theaters" WHERE "theaters"."id" = ?  [["id", 2]]
---
  def destroy
    t = Theater.find_by_id(params[:id])
    t.destroy